# FailureDefinitionId Class

---
The unique identifier of a FailureDefinition.
SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DBFailureDefinitionId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FailureDefinitionId : GuidEnum

    Public Class FailureDefinitionId
    	Inherits GuidEnum

    public ref class FailureDefinitionId : public GuidEnum

    type FailureDefinitionId =
        class
            inherit GuidEnum
        end
The FailureDefinitionId type exposes the following members.
| Name| Description
---|---|---
| FailureDefinitionId| Creates a new FailureDefinitionId instance.
Top
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
| Name| Description
---|---|---
| Equals|  Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from GuidEnum)
| GetHashCode|  Generates a hash code for this Guid-based enum object. (Inherited from GuidEnum)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(FailureDefinitionId, FailureDefinitionId)| Compares two FailureDefinitionId instances.
| Inequality(FailureDefinitionId, FailureDefinitionId)| Compares two FailureDefinitionId instances.
Top
Each possible failure in Revit must be defined and registered during Revit application startup by creating a FailureDefinition object. Unique FailureDefinitionId must be used as a key to register FailureDefinition. Those unique FailureDefinitionId should be created using GUID generation tool. Later FailureDefinitionId can be used to lookup FailureDefinition in FailureDefinitionRegistry, and create and post FailureMessages.
#### Reference
Autodesk.Revit.DB Namespace